////////////////////// Если ИНСТЕРЕСНО //////////////////////
//////////////////////      ВРЕМЯ      //////////////////////

import time
print(time.time()) # 1603275241 

# Возвращает текущее время календаря системы в количестве секунд, 
# прошедших с 1 января 1970 года.Как же быстро бежит вреся 

print(time.ctime()) # Wed Oct 21 10:14:01 2020

#  Bозвращает указатель на строку, содержащую информацию, 
#   хранящуюся в структуре, на которую указывает время, 
#   преобразованное в форму: day month date hours: minutes: seconds year

# time()        // возвращает текущее время, прошедшее с начала 1970 года в секундах.
# ctime(s)      // возвращает местное время в строке или время, полученное из s секунд.
# clock()       // возвращает процессорное время, прошедшее с момента первого вызова этой функции, точность больше 1 микросекунды.
# sleep(s)      // останавливает ход выполнения программы ровно на s секунд.
# strftime(s)   // преобразует переданное в качестве аргумента время s в строку по формату.
# strptime(s)   // разбирает строку s и преобразует в объект времени по формату.
# mktime(s)     // преобразует время s в количество секунд с начала 1970 года.


# // Jarosloov //
